In [3]:
import pandas as pd
file_path = './sample.csv' # 현재경로
df1 = pd.read_csv(file_path)
df2 = pd.read_csv(file_path, header = None) # 첫줄을 열이름으로 하지 않겠다.
df3 = pd.read_csv(file_path, index_col = 'c0') # 거의 안씀
# df6 = pd.read_csv(file_path, delimiter=',') # 구분자를 , 로
# df6 = pd.read_csv(file_path, delimiter='\t') # 구분자를 탭으로

In [2]:
df1

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [4]:
df2

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

In [5]:
df3

    c1  c2  c3
c0
0    1   4   7
1    2   5   8
2    3   6   9

In [7]:
data = {'name' : ['Jerry', 'Riah', 'Raul'],
       'algol' : ["A", "A+", "B"],
       'basic' : ["C", "B", "B+"],
       'c++' : ['B+', 'C', 'C+']}

In [15]:
df = pd.DataFrame(data)
df2 = pd.DataFrame(data)

In [16]:
df2.set_index('name', inplace=True)

In [17]:
print(df)
print(df2)

    name algol basic c++
0  Jerry     A     C  B+
1   Riah    A+     B   C
2   Raul     B    B+  C+
      algol basic c++
name
Jerry     A     C  B+
Riah     A+     B   C
Raul      B    B+  C+

In [21]:
df.to_csv('./df_sample.csv')
df2.to_csv('./df_sample2.csv')

In [22]:
result1 = pd.read_csv('./df_sample.csv')
result2 = pd.read_csv('./df_sample2.csv')

In [23]:
print(result1)
print(result2)

   Unnamed: 0   name algol basic c++
0           0  Jerry     A     C  B+
1           1   Riah    A+     B   C
2           2   Raul     B    B+  C+
    name algol basic c++
0  Jerry     A     C  B+
1   Riah    A+     B   C
2   Raul     B    B+  C+